# VertexPair Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexPair Members
VertexPair Class Constructors Methods Properties See Also
---
The VertexPair type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| VertexPair | Constructs a new VertexPair from a pair of indices in the curve loops. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the VertexPair |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| First | Identifies the first index of VertexPair. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Second | Identifies the second index of VertexPair. |

# See Also
VertexPair Class
Autodesk.Revit.DB Namespace